# basics

brew "stow"
brew "lsd"
brew "htop"
brew "btop"
brew "git"
brew "tree"
brew "wget"
brew "curl"

# infosec

brew "netcat"
brew "nmap"
brew "gnupg"

# javascript

brew "node"

# GenAI

brew "ollama"

# python

brew "pyenv"
brew "python@3.14"
cask "pycharm"

# rust

brew "rust"

# virtualization

brew "qemu"
cask "virtualbox"

# terminal

cask "iterm2"
brew "starship"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"

# apps

cask "google-chrome"
cask "audacity"
cask "calibre"
cask "firefox"
cask "libreoffice"
cask "steam"

# downloads

brew "get_iplayer"

# IDEs

cask "intellij-idea-ce"

cask "visual-studio-code"
vscode "alexkrechik.cucumberautocomplete"
vscode "batisteo.vscode-django"
vscode "bazelbuild.vscode-bazel"
vscode "dgileadi.java-decompiler"
vscode "donjayamanne.jupyter"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "ithildir.java-properties"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.theme-tomorrowkit"
vscode "njpwerner.autodocstring"
vscode "pepri.subtitles-editor"
vscode "pverest.java-ide-pack"
vscode "redhat.java"
vscode "redhat.vscode-community-server-connector"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shengchen.vscode-checkstyle"
vscode "tomphilbin.gruvbox-themes"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "youmaycallmev.vscode-java-saber"
