# basics

brew 'stow'
brew 'lsd'
brew 'htop'
brew 'btop'
brew 'git'
brew 'tree'
brew 'wget'
brew 'curl'
brew 'fastfetch'

# terminal

cask 'ghostty'
brew 'starship'
cask 'font-fira-code'
cask 'font-jetbrains-mono-nerd-font'

# git

brew 'git-gui'
brew 'git-delta'

# IDEs & text editors

cask 'intellij-idea'
cask 'zed'

## nvim and its dependencies
brew 'nvim'
brew 'fd'
brew 'ripgrep'
brew 'fzf'
brew 'ast-grep'
brew 'luarocks'

# virtualization & containerization

brew 'qemu'
cask 'virtualbox'
cask 'docker-desktop'

# api clients

cask 'bruno'
brew 'httpie'

# browsers

cask 'duckduckgo'
cask 'google-chrome'
cask 'ungoogled-chromium'
cask 'firefox'

# make & co

brew 'autogen'
brew 'automake'
brew 'cmake'
brew 'gnutls'
brew 'readline'
brew 'texinfo'

# infosec

brew 'nmap'
brew 'gnupg'
brew 'pinentry-mac'
brew 'gpgme'
cask 'gpg-suite-no-mail'
cask 'mitmproxy'
brew 'tcpdump'
brew 'wakeonlan'
brew 'aircrack-ng'
cask 'proton-drive'
cask 'protonvpn'

# downloads

cask 'transmission'
brew 'get_iplayer'
brew 'yt-dlp'

# GenAI

brew 'llama.cpp'
cask 'ollama-app'
brew 'opencode'
cask 'opencode-desktop'
brew 'llmfit'

# databases

cask 'db-browser-for-sqlite'

# other apps

cask 'audacity'
cask 'calibre'
cask 'libreoffice'
cask 'steam'
cask 'netnewswire'

# programming languages

## javascript
brew 'node'
brew 'jq'
brew 'pnpm'

## python
brew 'pyenv'
brew 'python@3.14'

## go
brew 'go'

## ruby
brew 'ruby'
